<a href="https://colab.research.google.com/github/DianaMutekhele/DATABASES/blob/main/SQL_Practicals.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Introduction to SQL Database commands

In [ ]:
# installing the sqlite database

!pip install db-sqlite3

Collecting db-sqlite3
  Downloading db-sqlite3-0.0.1.tar.gz (1.4 kB)
Collecting db
  Downloading db-0.1.1.tar.gz (3.4 kB)
Collecting antiorm
  Downloading antiorm-1.2.1.tar.gz (171 kB)
     |████████████████████████████████| 171 kB 5.1 MB/s
Building wheels for collected packages: db-sqlite3, db, antiorm
  Building wheel for db-sqlite3 (setup.py) ... done
  Created wheel for db-sqlite3: filename=db_sqlite3-0.0.1-py3-none-any.whl size=1795 sha256=1b2f73d6fb64c68c628128540245eddeea209d296682ae587d5ced6a1d70cf91
  Stored in directory: /root/.cache/pip/wheels/02/38/d5/2f54461050571bf5330fee2a37ab1c9b5e7540b0572f1acdab
  Building wheel for db (setup.py) ... done
  Created wheel for db: filename=db-0.1.1-py3-none-any.whl size=3894 sha256=98395b1ffe878f65addb6bc339e6af2a5559757b1c145078dc3a8ddc7cedaac0
  Stored in directory: /root/.cache/pip/wheels/8e/97/82/741d2b360507411ec233d0280d7371faa94b03bde834e4a9be
  Building wheel for antiorm (setup.py) ... done
  Created wheel for antiorm: filename=antiorm-1.2.1-py3-none-any.whl size=31678 sha256=fcbbd1107343f6c3cd799ddff72ce763a7cf5ea4aab4fc84c34e3223a079a55c
  Stored in directory: /root/.cache/pip/wheels/c5/43/70/e9729370cfff40c49d3e3d05377d54b3ecd71f64e62341ea80
Successfully built db-sqlite3 db antiorm
Installing collected packages: antiorm, db, db-sqlite3
Successfully installed antiorm-1.2.1 db-0.1.1 db-sqlite3-0.0.1

In [ ]:
# import the required libraries sqlite, pandas, and date time
import sqlite3
import pandas as pd
from datetime import date

#Read 3 csv files into  google colab environment

In [ ]:
Athletes = pd.read_csv('sample_data/Athletes.csv')
Athletes.shape

(11085, 3)

In [ ]:
Athletes.head(10)

                                                           Name
AALERUD Katrine   Norway                           Cycling Road
ABAD Nestor       Spain                     Artistic Gymnastics
ABAGNALE Giovanni Italy                                  Rowing
ABALDE Alberto    Spain                              Basketball
ABALDE Tamara     Spain                              Basketball
ABALO Luc         France                               Handball
ABAROA Cesar      Chile                                  Rowing
ABASS Abobakr     Sudan                                Swimming
ABBASALI Hamideh  Islamic Republic of Iran               Karate
ABBASOV Islam     Azerbaijan                          Wrestling

In [ ]:
Medals = pd.read_csv('sample_data/Medals.csv')
Medals.shape

(93, 7)

In [ ]:
Medals.head

<bound method NDFrame.head of     Rank                    Team/NOC  Gold  ...  Bronze  Total  Rank by Total
0      1    United States of America    39  ...      33    113              1
1      2  People's Republic of China    38  ...      18     88              2
2      3                       Japan    27  ...      17     58              5
3      4               Great Britain    22  ...      22     65              4
4      5                         ROC    20  ...      23     71              3
..   ...                         ...   ...  ...     ...    ...            ...
88    86                       Ghana     0  ...       1      1             77
89    86                     Grenada     0  ...       1      1             77
90    86                      Kuwait     0  ...       1      1             77
91    86         Republic of Moldova     0  ...       1      1             77
92    86        Syrian Arab Republic     0  ...       1      1             77

[93 rows x 7 columns]>

In [ ]:
Teams = pd.read_csv('sample_data/Teams.csv')
Teams.shape

(743, 4)

In [ ]:
Teams.head(20)

             Name      Discipline                         NOC         Event
0         Belgium  3x3 Basketball                     Belgium           Men
1           China  3x3 Basketball  People's Republic of China           Men
2           China  3x3 Basketball  People's Republic of China         Women
3          France  3x3 Basketball                      France         Women
4           Italy  3x3 Basketball                       Italy         Women
5           Japan  3x3 Basketball                       Japan           Men
6           Japan  3x3 Basketball                       Japan         Women
7          Latvia  3x3 Basketball                      Latvia           Men
8        Mongolia  3x3 Basketball                    Mongolia         Women
9     Netherlands  3x3 Basketball                 Netherlands           Men
10         Poland  3x3 Basketball                      Poland           Men
11            ROC  3x3 Basketball                         ROC           Men
12            ROC  3x3 Basketball                         ROC         Women
13        Romania  3x3 Basketball                     Romania         Women
14         Serbia  3x3 Basketball                      Serbia           Men
15  United States  3x3 Basketball    United States of America         Women
16      Australia         Archery                   Australia    Men's Team
17      Australia         Archery                   Australia    Mixed Team
18     Bangladesh         Archery                  Bangladesh    Mixed Team
19        Belarus         Archery                     Belarus  Women's Team

#  Create a connection to a database.

In [ ]:
#connect with test db

db =sqlite3.connect("test.db")

#  Insert tables into the created database

In [ ]:
db.execute("DROP TABLE IF EXISTS Athletes")
db.execute("DROP TABLE IF EXISTS Medals")
db.execute("DROP TABLE IF EXISTS Teams")

In [ ]:
#Write the Athletes data frame into the database using pandas function to_sql
Athletes.to_sql('Athletes', con=db, if_exists='replace', index = False)

In [ ]:
#Write the Medals data frame into the database using pandas function to_sql
Medals.to_sql('Medals', con=db, if_exists='replace', index = False)

/usr/local/lib/python3.7/dist-packages/pandas/core/generic.py:2615: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

In [ ]:
#Write the Teams data frame into the database using pandas function to_sql
Teams.to_sql('Teams', con=db, if_exists='replace', index = False)

# Read data from the database tables into Python environment

In [ ]:
Medals_1 = pd.read_sql_query(
    'SELECT * FROM Medals',
     db)
print(Medals_1.shape)
Medals_1.head()

(93, 7)

   Rank                    Team/NOC  Gold  Silver  Bronze  Total  Rank by Total
0     1    United States of America    39      41      33    113              1
1     2  People's Republic of China    38      32      18     88              2
2     3                       Japan    27      14      17     58              5
3     4               Great Britain    22      21      22     65              4
4     5                         ROC    20      28      23     71              3

In [ ]:
Athletes_1 = pd.read_sql_query(
    'SELECT * FROM Athletes',
     db)
print(Athletes_1.shape)
Athletes_1.head(20)

(11085, 3)

                       Name                       NOC           Discipline
0           AALERUD Katrine                    Norway         Cycling Road
1               ABAD Nestor                     Spain  Artistic Gymnastics
2         ABAGNALE Giovanni                     Italy               Rowing
3            ABALDE Alberto                     Spain           Basketball
4             ABALDE Tamara                     Spain           Basketball
5                 ABALO Luc                    France             Handball
6              ABAROA Cesar                     Chile               Rowing
7             ABASS Abobakr                     Sudan             Swimming
8          ABBASALI Hamideh  Islamic Republic of Iran               Karate
9             ABBASOV Islam                Azerbaijan            Wrestling
10             ABBINGH Lois               Netherlands             Handball
11              ABBOT Emily                 Australia  Rhythmic Gymnastics
12            ABBOTT Monica  United States of America    Baseball/Softball
13  ABDALLA Abubaker Haydar                     Qatar            Athletics
14           ABDALLA Maryam                     Egypt    Artistic Swimming
15           ABDALLAH Shahd                     Egypt    Artistic Swimming
16      ABDALRASOOL Mohamed                     Sudan                 Judo
17        ABDEL LATIF Radwa                     Egypt             Shooting
18         ABDEL RAZEK Samy                     Egypt             Shooting
19        ABDELAZIZ Abdalla                     Egypt               Karate

In [ ]:
Teams_1 = pd.read_sql_query(
    'SELECT * FROM Teams',
     db)
print(Teams_1.shape)
Teams_1.head(6)

(743, 4)

      Name      Discipline                         NOC  Event
0  Belgium  3x3 Basketball                     Belgium    Men
1    China  3x3 Basketball  People's Republic of China    Men
2    China  3x3 Basketball  People's Republic of China  Women
3   France  3x3 Basketball                      France  Women
4    Italy  3x3 Basketball                       Italy  Women
5    Japan  3x3 Basketball                       Japan    Men

# Perform SELECT operations on the database tables

In [ ]:
Teams_1 = pd.read_sql_query(
    'SELECT * FROM Teams WHERE Name= "China"',
     db)
print(Teams_1.shape)
Teams_1.head(6)

(30, 4)

    Name           Discipline                         NOC         Event
0  China       3x3 Basketball  People's Republic of China           Men
1  China       3x3 Basketball  People's Republic of China         Women
2  China              Archery  People's Republic of China    Men's Team
3  China              Archery  People's Republic of China    Mixed Team
4  China              Archery  People's Republic of China  Women's Team
5  China  Artistic Gymnastics  People's Republic of China    Men's Team

In [ ]:
Athletes_1 = pd.read_sql_query(
    'SELECT * FROM Athletes WHERE NOC="Spain"',
     db)
print(Athletes_1.shape)
Athletes_1.head()

(324, 3)

                        Name    NOC           Discipline
0                ABAD Nestor  Spain  Artistic Gymnastics
1             ABALDE Alberto  Spain           Basketball
2              ABALDE Tamara  Spain           Basketball
3                ABIAN Pablo  Spain            Badminton
4  ABRINES REDONDO Alejandro  Spain           Basketball

In [ ]:
Medals_1 = pd.read_sql_query(
    'SELECT * FROM Medals WHERE Total<10',
     db)
print(Medals_1.shape)
Medals_1.head()

(68, 7)

   Rank                  Team/NOC  Gold  Silver  Bronze  Total  Rank by Total
0    20                    Norway     4       2       2      8             29
1    21                   Jamaica     4       1       4      9             26
2    23                    Sweden     3       6       0      9             26
3    26                   Croatia     3       3       2      8             29
4    27  Islamic Republic of Iran     3       2       2      7             33

In [ ]:
Medals_1 = pd.read_sql_query(
    'SELECT * FROM Medals WHERE Gold<10 AND Bronze>5',
     db)
print(Medals_1.shape)
Medals_1.head()

(11, 7)

   Rank           Team/NOC  Gold  Silver  Bronze  Total  Rank by Total
0    11             Canada     7       6      11     24             11
1    12             Brazil     7       6       8     21             12
2    13        New Zealand     7       6       7     20             13
3    15            Hungary     6       7       7     20             13
4    16  Republic of Korea     6       4      10     20             13